IDEA Open Model
FemElement Class
Compatible with IDEA StatiCa Beta 20.0
 Provides information about FEM element
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.FemElement
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
[SerializableAttribute]
public class FemElement
<SerializableAttribute>
Public Class FemElement
The FemElement type exposes the following members.
Constructors
Name | Description
FemElement()
 Constructor
FemElement(Int32, Int32, Int32)
 Constructor for triangular element 2d
FemElement(Int32, Int32, Int32, Int32)
 Constructor for quadrilateral element 2D
Top
Properties
Name | Description
Type
 Type of the finite element 1 - triangular element 2D 2 - quadrilateral element 2D
Vertices
 Get list of vertices of the fem element
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace